Repository: CircuitVerse/mobile-app
Catalog: lib/l10n/app_*.arb
Languages: hi

# ib_return_home
source: Return to Home
hi: होम पर वापस जाएं

# ib_home
source: Interactive Book Home
hi: इंटरएक्टिव बुक होम

# ib_loading_chapters
source: Loading Chapters...
hi: अध्याय लोड हो रहे हैं...

# ib_show_toc
source: Show Table of Contents
hi: विषय सूची दिखाएं

# ib_page_copyright_notice
source: Copyright © 2021 Contributors to CircuitVerse. Distributed under a [CC-by-sa] license.
hi: कॉपीराइट © 2021 सर्किटवर्स के योगदानकर्ता। [CC-by-sa] लाइसेंस के तहत वितरित।

# ib_page_table_of_contents
source: Table of Contents
hi: विषय सूची

# ib_page_navigate_previous
source: Tap to navigate to previous page
hi: पिछले पृष्ठ पर जाने के लिए टैप करें

# ib_page_navigate_next
source: Tap to navigate to next page
hi: अगले पृष्ठ पर जाने के लिए टैप करें

# ib_page_loading_image
source: Loading image...
hi: छवि लोड हो रही है...

# ib_page_image_load_error
source: Failed to load image
hi: छवि लोड करने में विफल

# ib_page_no_image_source
source: No image source provided
hi: कोई छवि स्रोत प्रदान नहीं किया गया

# notifications_no_notifications
source: No notifications yet
hi: अभी तक कोई सूचनाएं नहीं हैं

# notifications_will_appear
source: Your notifications will appear here
hi: आपकी सूचनाएं यहां दिखाई देंगी

# notifications_no_unread
source: No unread notifications
hi: कोई अनपढ़ सूचनाएं नहीं

# notifications_no_unread_desc
source: You have no unread notifications
hi: आपके पास कोई अनपढ़ सूचनाएं नहीं हैं

# notifications_all
source: All
hi: सभी

# notifications_unread
source: Unread
hi: अनपढ़

# notifications_starred
source: starred
hi: स्टार किया

# notifications_forked
source: forked
hi: फोर्क किया

# notifications_your_project
source: your project
hi: आपका प्रोजेक्ट

# profile_view_not_available
source: N.A
hi: उपलब्ध नहीं

# profile_view_edit
source: Edit Profile
hi: प्रोफ़ाइल संपादित करें

# profile_view_joined
source: Joined
hi: जुड़े

# profile_view_country
source: Country
hi: देश

# profile_view_educational_institute
source: Educational Institute
hi: शैक्षणिक संस्थान

# profile_view_subscribed_to_mails
source: Subscribed to mails
hi: मेल की सदस्यता ली

# profile_view_yes
source: Yes
hi: हाँ

# profile_view_no
source: No
hi: नहीं

# profile_view_title
source: Profile
hi: प्रोफ़ाइल

# profile_view_circuits
source: Circuits
hi: सर्किट

# profile_view_favourites
source: Favourites
hi: पसंदीदा

# edit_project_name
source: Name
hi: नाम

# edit_project_name_validation_error
source: Name cannot be empty
hi: नाम खाली नहीं हो सकता

# edit_project_tags_list
source: Tags List
hi: टैग सूची

# edit_project_access_type
source: Project Access Type
hi: प्रोजेक्ट एक्सेस प्रकार

# edit_project_access_type_validation_error
source: Please select project access type
hi: कृपया प्रोजेक्ट एक्सेस प्रकार चुनें

# edit_project_public
source: Public
hi: सार्वजनिक

# edit_project_private
source: Private
hi: निजी

# edit_project_limited_access
source: Limited Access
hi: सीमित पहुंच

# edit_project_updating
source: Updating project...
hi: प्रोजेक्ट अपडेट हो रहा है...

# edit_project_updated
source: Project updated
hi: प्रोजेक्ट अपडेट हो गया

# edit_project_update_success
source: Project updated successfully
hi: प्रोजेक्ट सफलतापूर्वक अपडेट हो गया

# edit_project_error
source: Error
hi: त्रुटि

# edit_project_title
source: Update Project
hi: प्रोजेक्ट अपडेट करें

# edit_project_edit
source: Edit
hi: संपादित करें

# edit_project_details
source: Project Details
hi: प्रोजेक्ट विवरण

# edit_project_share
source: Share
hi: शेयर करें

# edit_project_fork
source: Fork
hi: फोर्क

# edit_project_stars
source: Stars
hi: स्टार्स

# edit_project_views
source: Views
hi: व्यूज

# edit_project_author
source: Author
hi: लेखक

# edit_project_description
source: Description
hi: विवरण

# edit_project_add_collaborator
source: Add Collaborator
hi: सहयोगी जोड़ें

# edit_project_delete
source: Delete
hi: हटाएं

# edit_project_collaborators
source: Collaborators
hi: सहयोगी

# edit_project_fork_project
source: Fork Project
hi: प्रोजेक्ट फोर्क करें

# edit_project_fork_confirmation
source: Are you sure you want to fork this project?
hi: क्या आप वाकई इस प्रोजेक्ट को फोर्क करना चाहते हैं?

# edit_project_forking
source: Forking
hi: फोर्क किया जा रहा है

# edit_project_starred
source: Project starred
hi: प्रोजेक्ट स्टार किया गया

# edit_project_unstarred
source: Project unstarred
hi: प्रोजेक्ट अनस्टार किया गया

# edit_project_starred_success
source: You have successfully starred the project
hi: आपने प्रोजेक्ट को सफलतापूर्वक स्टार किया है

# edit_project_unstarred_success
source: You have successfully unstarred the project
hi: आपने प्रोजेक्ट को सफलतापूर्वक अनस्टार किया है

# edit_project_add_collaborators
source: Add Collaborators
hi: सहयोगी जोड़ें

# edit_project_email_ids
source: Email IDs
hi: ईमेल आईडी

# edit_project_email_hint
source: Enter email IDs separated by comma
hi: ईमेल आईडी को कॉमा से अलग करके दर्ज करें

# edit_project_adding
source: Adding
hi: जोड़ा जा रहा है

# edit_project_collaborators_added
source: Collaborators added
hi: सहयोगी जोड़े गए

# edit_project_delete_project
source: Delete Project
hi: प्रोजेक्ट हटाएं

# edit_project_delete_confirmation
source: Are you sure you want to delete this project?
hi: क्या आप वाकई इस प्रोजेक्ट को हटाना चाहते हैं?

# edit_project_deleting
source: Deleting
hi: हटाया जा रहा है

# edit_project_deleted
source: Project deleted
hi: प्रोजेक्ट हटा दिया गया

# edit_project_delete_success
source: Project deleted successfully
hi: प्रोजेक्ट सफलतापूर्वक हटा दिया गया

# edit_project_delete_collaborator
source: Remove Collaborator
hi: सहयोगी हटाएं

# edit_project_delete_collaborator_confirmation
source: Are you sure you want to remove this collaborator?
hi: क्या आप वाकई इस सहयोगी को हटाना चाहते हैं?

# edit_project_collaborator_deleted
source: Collaborator removed
hi: सहयोगी हटा दिया गया

# edit_project_collaborator_delete_success
source: Collaborator removed successfully
hi: सहयोगी सफलतापूर्वक हटा दिया गया

# edit_cancel
source: Cancel
hi: रद्द करें

# edit_add
source: Add
hi: जोडें

# featured_no_result_found
source: No result found
hi: कोई परिणाम नहीं मिला

# featured_editor_picks
source: Editor's Picks
hi: संपादक की पसंद

# featured_editor_picks_description
source: Curated list of the best projects
hi: सर्वश्रेष्ठ प्रोजेक्ट्स की चयनित सूची

# featured_search_for_circuits
source: Search for circuits
hi: सर्किट खोजें

source: Featured Circuits
hi: विशेष सर्किट

# group_member_count
source: Total Members
hi: कुल सदस्य

# group_member_card_view
source: View
hi: देखें

# group_mentor_card_view
source: View
hi: देखें

# group_mentor_card_edit
source: Edit
hi: संपादित करें

# group_mentor_card_delete
source: Delete
hi: हटाएं

# group_mentor_count
source: Count
hi: गणना

# assignment_card_view
source: Show
hi: दिखाएं

# assignment_card_edit
source: Edit
hi: संपादित करें

# assignment_card_reopen
source: Reopen
hi: पुनः खोलें

# assignment_card_delete
source: Delete
hi: हटाएं

# assignment_card_view_submission
source: View Submission
hi: जमा देखें

# assignment_card_view_your_work
source: View Your Work
hi: अपना काम देखें

# assignment_card_start_working
source: Start Working
hi: काम शुरू करें

# assignment_card_not_submitted
source: Not Submitted!
hi: जमा नहीं किया गया!

# assignment_card_no_name
source: No Name
hi: कोई नाम नहीं

# assignment_card_grading
source: Grading
hi: ग्रेडिंग

# assignment_card_deadline
source: Deadline
hi: समय सीमा

# cv_title
source: CircuitVerse
hi: सर्किटवर्स

# cv_groups
source: Groups
hi: समूह

# cv_profile
source: Profile
hi: प्रोफ़ाइल

# cv_featured_circuits
source: Featured Circuits
hi: विशेष रुप से प्रदर्शित सर्किट

# cv_logout
source: Log Out
hi: लॉग आउट करें

# cv_logout_confirmation
source: Are you sure you want to logout?
hi: क्या आप वाकई लॉग आउट करना चाहते हैं?

# cv_logout_confirmation_button
source: LOGOUT
hi: लॉग आउट

# cv_logout_success
source: Logged Out Successfully
hi: सफलतापूर्वक लॉग आउट किया गया

# cv_logout_success_acknowledgement
source: You have been signed out.
hi: आपको साइन आउट कर दिया गया है।

# cv_home
source: Home
hi: होम

# cv_explore
source: Explore
hi: एक्सप्लोर करें

# cv_simulator
source: Simulator
hi: सिमुलेटर

# cv_interactive_book
source: Interactive Book
hi: इंटरएक्टिव बुक

# cv_about
source: About
hi: सर्किटवर्स के बारे में

# cv_contribute
source: Contribute
hi: योगदान करे

# cv_teachers
source: Teachers
hi: शिक्षकों के लिए

# cv_my_groups
source: My Groups
hi: मेरे समूह

# cv_login
source: Login
hi: लॉग इन करें

# cv_notifications
source: Notifications
hi: सूचनाएं

# cv_language
source: Language
hi: भाषा

source: Terms Of Service
hi: सेवा की शर्तें

source: Privacy Policy
hi: गोपनीयता नीति

source: Loading Contributors ...
hi: योगदानकर्ता लोड हो रहे हैं ...

# about_title
source: ABOUT
hi: सर्किटवर्स के बारे में जाने

# about_subtitle
source: Learn about the Awesome people behind CircuitVerse
hi: सर्किटवर्स के पीछे योगदानकर्ताओं के बारे में जानें

# about_description
source: CircuitVerse is a product developed by students at IIIT-Bangalore. It aims to provide a platform where circuits can be designed and simulated using a graphical user interface. While users can design complete CPU implementations within the simulator, the software is designed primarily for educational use. CircuitVerse is an opensource project with an active community. Checkout the contribute page for more detail.
hi: सर्किटवर्स आईआईआईटी-बैंगलोर के छात्रों द्वारा विकसित एक प्रोडक्ट है। इसका उद्देश्य एक ऐसा मंच प्रदान करना है जहां ग्राफिकल यूजर इंटरफेस का उपयोग करके सर्किट की रचना और उसका सिमुलेशन किया जा सकता है। जबकि उपयोगकर्ता सिम्युलेटर के द्वारा पूर्ण सीपीयू कार्यान्वयन की रचना कर सकते हैं, सॉफ्टवेयर की रचना प्राथमिक रूप से शैक्षिक उपयोग के लिए की गयी है। सर्किटवर्स एक सक्रिय समुदाय के साथ एक ओपन-सोर्स परियोजना है। अधिक जानकारी के लिए योगदान पृष्ठ देखिये।

source: Email us at
hi: हमें ईमेल करें

# join_slack
source: Join and chat with us at
hi: हमारे साथ जुड़ें और चैट करें

# about_slack_channel
source: Slack channel
hi: स्लैक चैनल

source: Contributors
hi: योगदानकर्ता

# contributors_subtitle
source: Meet the awesome people of CircuitVerse community that've made this platform what it is now.
hi: सर्किटवर्स समुदाय के योगदानकर्ताओं से मिलें जिन्होंने इस मंच को बेहतर बनाया है।

# tos_section1_title
source: 1. User Agreement
hi: 1. उपयोगकर्ता समझौता

# tos_section1_text1_string1
source: 1.1 These Terms of Use constitute an agreement between you and the CircuitVerse Team that governs your use of
hi: 1.1 उपयोग की ये शर्तें आपके और सर्किटवर्स टीम के बीच एक अनुबंध का गठन करती हैं जो आपके

# tos_section1_text1_string2
source: . The CircuitVerse Team comprises of faculty and students of International Institute of Information Technology, Bangalore ("IIIT-Bangalore"). Please read the Terms of Use carefully. By using CircuitVerse you affirm that you have read, understood, and accepted the terms and conditions in the Terms of Use. If you do not agree with any of these conditions, please do not use CircuitVerse.
hi: के उपयोग को नियंत्रित करती है। सर्किटवर्स टीम में अंतर्राष्ट्रीय सूचना प्रौद्योगिकी संस्थान, बैंगलोर ("आईआईआईटी-बैंगलोर") के संकाय और छात्र शामिल हैं। कृपया उपयोग की शर्तों को ध्यान से पढ़ें। सर्किटवर्स का उपयोग करके आप पुष्टि करते हैं कि आपने उपयोग की शर्तों में नियमों और शर्तों को पढ़, समझ और स्वीकार कर लिया है। यदि आप इनमें से किसी भी शर्त से सहमत नहीं हैं, तो कृपया सर्किटवर्स का उपयोग न करें।

# tos_section1_text2
source: 1.2 Your privacy is important to us. Please read our Privacy Policy, which identifies how the CircuitVerse Team uses, collects, and stores information it collects through the Services. By using CircuitVerse, you additionally agree that you are comfortable with CircuitVerse's Privacy Policy.
hi: 1.2 आपकी गोपनीयता हमारे लिए महत्वपूर्ण है। कृपया हमारी गोपनीयता नीति पढ़ें, जो यह पहचानती है कि कैसे सर्किटवर्स टीम सेवाओं के माध्यम से एकत्रित जानकारी का उपयोग, संग्रह और संग्रह करती है। सर्किटवर्स का उपयोग करके, आप अतिरिक्त रूप से सहमत हैं कि आप सर्किटवर्स की गोपनीयता नीति के साथ सहज हैं।

# tos_section1_text3
source: 1.3 CircuitVerse is open to children and adults of all ages, and we ask that you keep this in mind when using the CircuitVerse services.
hi: 1.3 सर्किटवर्स सभी उम्र के बच्चों और वयस्कों के लिए खुला है, और हम चाहते हैं कि आप सर्किटवर्स सेवाओं का उपयोग करते समय इसे ध्यान में रखें।

# tos_section1_text4_string1
source: 1.4 The CircuitVerse Team may change the Terms of Use from time to time. You can always find the latest version of the Terms of Use at
hi: 1.4 सर्किटवर्स टीम समय-समय पर उपयोग की शर्तों को बदल सकती है। आप उपयोग की शर्तों का नवीनतम संस्करण हमेशा

# tos_section1_text4_string2
source: . Your continued use of the Services constitutes your acceptance of any changes to or revisions of the Terms of Use.
hi: पर पा सकते हैं। सेवाओं का आपका निरंतर उपयोग उपयोग की शर्तों में किसी भी परिवर्तन या संशोधन की आपकी स्वीकृति का गठन करता है।

# tos_section2_title
source: 2. Account Creation and Maintenance
hi: 2. खाता निर्माण और रखरखाव

# tos_section2_text1_string1
source: 2.1 In order to use some features of the Services, you will need to register with CircuitVerse and create an account. Creating an account is optional, but without an account, you will not be able to save or publish projects or comments on CircuitVerse. When registering for a personal account, you will be asked to provide certain personal information, such as your email address, gender, birth month and year, and country. Please see CircuitVerse's
hi: 2.1 सेवाओं की कुछ विशेषताओं का उपयोग करने के लिए, आपको सर्किटवर्स के साथ पंजीकरण करना होगा और एक खाता बनाना होगा। एक खाता बनाना वैकल्पिक है, लेकिन एक खाते के बिना, आप सर्किटवर्स पर परियोजनाओं या टिप्पणियों को सहेज या प्रकाशित नहीं कर पाएंगे। व्यक्तिगत खाते के लिए पंजीकरण करते समय, आपको कुछ व्यक्तिगत जानकारी प्रदान करने के लिए कहा जाएगा, जैसे कि आपका ईमेल पता, लिंग, जन्म का महीना और वर्ष और देश। सर्किटवर्स की डेटा प्रतिधारण और उपयोग नीतियों के लिए कृपया सर्किटवर्स की

# tos_section2_text1_string2
source: for CircuitVerse's data retention and usage policies.
hi: देखें।

# tos_section2_text2
source: 2.2 You are responsible for keeping your password secret and your account secure. You are solely responsible for any use of your account, even if your account is used by another person. If any use of your account violates the Terms of Service, your account may be suspended or deleted.
hi: 2.2 आप अपने पासवर्ड को गुप्त रखने और अपने खाते को सुरक्षित रखने के लिए जिम्मेदार हैं। आप अपने खाते के किसी भी उपयोग के लिए पूरी तरह से जिम्मेदार हैं, भले ही आपका खाता किसी अन्य व्यक्ति द्वारा उपयोग किया गया हो। यदि आपके खाते का कोई भी उपयोग सेवा की शर्तों का उल्लंघन करता है, तो आपका खाता निलंबित या हटाया जा सकता है।

# tos_section2_text3
source: 2.3 You may not use another person's CircuitVerse account without permission.
hi: 2.3 आप अनुमति के बिना किसी अन्य व्यक्ति के सर्किटवर्स खाते का उपयोग नहीं कर सकते हैं।

# tos_section2_text4
source: 2.4 If you have reason to believe that your account is no longer secure (for example, in the event of a loss, theft, or unauthorized disclosure of your password), promptly change your password. If you cannot access your account to change your password, notify us at
hi: 2.4 यदि आपके पास यह मानने का कारण है कि आपका खाता अब सुरक्षित नहीं है (उदाहरण के लिए, आपके पासवर्ड के खोने, चोरी होने या अनधिकृत प्रकटीकरण की स्थिति में), तो तुरंत अपना पासवर्ड बदलें। यदि आप अपना पासवर्ड बदलने के लिए अपने खाते तक नहीं पहुंच सकते हैं, तो हमें यहां सूचित करें

# tos_section3_title
source: 3. Rules of Usage
hi: 3. उपयोग के नियम

# tos_section3_text1
source: 3.1 The CircuitVerse Team supports freedom of expression. However, CircuitVerse is intended for a wide audience, and some content is inappropriate for the CircuitVerse community. You may not use the CircuitVerse service in any way, that:
hi: 3.1 सर्किटवर्स टीम अभिव्यक्ति की स्वतंत्रता का समर्थन करती है। हालांकि, सर्किटवर्स व्यापक दर्शकों के लिए है, और कुछ सामग्री सर्किटवर्स समुदाय के लिए अनुपयुक्त है। आप किसी भी तरह से सर्किटवर्स सेवा का उपयोग नहीं कर सकते हैं, कि:

# tos_section3_item1
source: 1. Posting content deliberately designed to crash the CircuitVerse website or editor;
hi: 1. सर्किटवर्स वेबसाइट या एडिटर को क्रैश करने के लिए जानबूझकर डिज़ाइन किया गया कंटेंट पोस्ट करना;

# tos_section3_item2
source: 2. Linking to pages containing viruses or malware;
hi: 2. वायरस या मैलवेयर वाले पेज से लिंक करना;

# tos_section3_item3
source: 3. Using administrator passwords or pretending to be an administrator;
hi: 3. व्यवस्थापक का पासवर्ड का उपयोग करना या व्यवस्थापक होने का नाटक करना;

# tos_section3_item4
source: 4. Repeatedly posting the same material, or "spamming";
hi: 4. एक ही कंटेंट को बार-बार पोस्ट करना, या "स्पैमिंग" करना;

# tos_section3_item5
source: 5. Using alternate accounts or organizing voting groups to manipulate site statistics, such as purposely trying to get on the "What the Community is Loving/Remixing" rows of the front page.
hi: 5. साइट के स्टेटिस्टिक्स में हेरफेर करने के लिए वैकल्पिक खातों का उपयोग करना या मतदान समूहों को व्यवस्थित करना, जैसे कि जानबूझकर "समुदाय क्या पसंद कर रहा है" पहले पन्ने की रौस पर।

# tos_section4_title
source: 4. User-Generated Content and Licensing
hi: 4. उपयोगकर्ता-जनित सामग्री और लाइसेंसिंग

# tos_section4_text1
source: 4.1 For the purposes of the Terms of Use, "user-generated content" includes any projects, comments, forum posts, or links to third party websites that a user submits to CircuitVerse.
hi: 4.1 उपयोग की शर्तों के प्रयोजनों के लिए, "उपयोगकर्ता द्वारा निर्मित सामग्री" इसमें कोई भी प्रोजेक्ट, टिप्पणियां, फोरम पोस्ट या तीसरे पक्ष की वेबसाइटों के लिंक शामिल हैं जो उपयोगकर्ता सर्किटवर्स को सबमिट करता है।

# tos_section4_text2
source: 4.2 The CircuitVerse Team encourages everyone to foster creativity by freely sharing knowledge in any form. However, we also understand the need for individuals and companies to protect their intellectual property rights. You are responsible for making sure you have the necessary rights, licenses, or permission for any user-generated content you submit to CircuitVerse.
hi: 4.2 सर्किटवर्स टीम किसी भी रूप में ज्ञान को स्वतंत्र रूप से साझा करके रचनात्मकता को बढ़ावा देने के लिए सभी को प्रोत्साहित करती है। हालांकि, हम व्यक्तियों और कंपनियों को अपने बौद्धिक संपदा अधिकारों की रक्षा करने की आवश्यकता को भी समझते हैं। आप यह सुनिश्चित करने के लिए ज़िम्मेदार हैं कि आपके पास सर्किटवर्स को सबमिट की गई किसी भी उपयोगकर्ता-निर्मित सामग्री के लिए आवश्यक अधिकार, लाइसेंस या अनुमति है।

# tos_section4_text3_string1
source: 4.3 All user-generated content you submit to CircuitVerse is licensed to and through CircuitVerse under the
hi: 4.3 आपके द्वारा सर्किटवर्स को सबमिट की जाने वाली सभी उपयोगकर्ता-जनित सामग्री को

# tos_section4_text3_link
source: Creative Commons Attribution-ShareAlike 2.0 license
hi: क्रिएटिव कॉमन्स एट्रिब्यूशन-शेयरएलाइक 2.0 लाइसेंस

# tos_section4_text3_string2
source: . This allows others to view and fork your content. This license also allows the CircuitVerse Team to display, distribute, and reproduce your content on the CircuitVerse website, through social media channels, and elsewhere. If you do not want to license your content under this license, then do not share it on CircuitVerse.
hi: के तहत और सर्किटवर्स के माध्यम से लाइसेंस प्राप्त है। . यह दूसरों को आपकी सामग्री को देखने और फोर्क करने की अनुमति देता है। यह लाइसेंस सर्किटवर्स टीम को आपकी सामग्री को सर्किटवर्स वेबसाइट पर, सोशल मीडिया चैनलों और अन्य जगहों पर प्रदर्शित करने, वितरित करने और पुन: पेश करने की अनुमति देता है। यदि आप इस लाइसेंस के तहत अपनी सामग्री को लाइसेंस नहीं देना चाहते हैं, तो इसे सर्किटवर्स पर साझा न करें।

# tos_section4_text4
source: 4.4 In addition to reviewing reported user-generated content, the CircuitVerse Team reserves the right, but is not obligated, to monitor all uses of the CircuitVerse service. The CircuitVerse Team may edit, move, or delete any content that violates the Terms of Use or Community Guidelines, without notice.
hi: 4.4 रिपोर्ट की गई उपयोगकर्ता-जनित सामग्री की समीक्षा करने के अलावा, सर्किटवर्स टीम सर्किटवर्स सेवा के सभी उपयोगों की निगरानी करने का अधिकार सुरक्षित रखती है, लेकिन बाध्य नहीं है। सर्किटवर्स टीम बिना किसी सूचना के उपयोग की शर्तों या सामुदायिक दिशानिर्देशों का उल्लंघन करने वाली किसी भी सामग्री को संपादित, स्थानांतरित या हटा सकती है।

# tos_section4_text5
source: 4.5 All user-generated content is provided as-is. The CircuitVerse Team makes no warranties about the accuracy or reliability of any user-generated content available through CircuitVerse and does not endorse CircuitVerse Day events or vet or verify information posted in connection with said events. The CircuitVerse Team does not endorse any views, opinions, or advice expressed in user-generated content. You agree to relieve the CircuitVerse Team of any and all liability arising from your user-generated content and from CircuitVerse Day events you may organize or host.
hi: 4.5 सभी उपयोगकर्ता-जनित सामग्री इस प्रकार प्रदान की जाती है। सर्किटवर्स टीम सर्किटवर्स के माध्यम से उपलब्ध किसी भी उपयोगकर्ता-जनित सामग्री की सटीकता या विश्वसनीयता के बारे में कोई वारंटी नहीं देती है और सर्किटवर्स डे की घटनाओं का समर्थन नहीं करती है या उक्त घटनाओं के संबंध में पोस्ट की गई जानकारी को सत्यापित या सत्यापित नहीं करती है। सर्किटवर्स टीम उपयोगकर्ता-जनित सामग्री में व्यक्त किसी भी विचार, राय या सलाह का समर्थन नहीं करती है। आप अपने उपयोगकर्ता-जनित सामग्री से उत्पन्न होने वाली किसी भी और सभी देयताओं के लिए सर्किटवर्स टीम को राहत देने के लिए सहमत हैं और सर्किटवर्स डे की घटनाओं से आप आयोजन या होस्ट कर सकते हैं।

# tos_section5_title
source: 5. CircuitVerse Content and Licensing
hi: 5. सर्किटवर्स सामग्री और लाइसेंसिंग

# tos_section5_text1
source: 5.1 Except for any user-generated content, the CircuitVerse Team owns and retains all rights in and to the CircuitVerse code, the design, functionality, and architecture of CircuitVerse, and any software or content provided through CircuitVerse (collectively "the CircuitVerse IP"). If you want to use CircuitVerse in a way that is not allowed by these Terms of Use, you must first contact the CircuitVerse Team. Except for any rights explicitly granted under these Terms of Use, you are not granted any rights in and to any CircuitVerse IP.
hi: 5.1 किसी भी उपयोगकर्ता-जनित सामग्री को छोड़कर, सर्किटवर्स टीम, सर्किटवर्स कोड, डिजाइन, कार्यक्षमता, और सर्किटवर्स के आर्किटेक्चर, और सर्किटवर्स (सामूहिक रूप से "सर्किटवर्स आईपी") . यदि आप इस तरह से सर्किटवर्स का उपयोग करना चाहते हैं जो इन उपयोग की शर्तों द्वारा अनुमत नहीं है, तो आपको पहले सर्किटवर्स टीम से संपर्क करना होगा। इन उपयोग की शर्तों के तहत स्पष्ट रूप से दिए गए किसी भी अधिकार को छोड़कर, आपको किसी भी सर्किटवर्स आईपी में और उसके लिए कोई अधिकार नहीं दिया गया है।

# tos_section6_title
source: 6. Digital Millennium Copyright Act (DMCA)
hi: 6. डिजिटल मिलेनियम कॉपीराइट एक्ट (डीएमसीए)

# tos_section6_text1
source: 6.1 If you are a copyright holder and believe that content on CircuitVerse violates your rights, you may send a mail to
hi: 6.1 यदि आप एक कॉपीराइट धारक हैं और मानते हैं कि सर्किटवर्स पर सामग्री आपके अधिकारों का उल्लंघन करती है, तो आप हमे एक मेल भेज सकते हैं

# tos_section6_text2
source: . 6.2 If you are a CircuitVerse user and you believe that your content did not constitute a copyright violation and was taken down in error, you may send a notification to support@CircuitVerse.org. Please include:
hi: । 6.2 यदि आप एक सर्किटवर्स उपयोगकर्ता हैं और आप मानते हैं कि आपकी सामग्री कॉपीराइट उल्लंघन का गठन नहीं करती है और गलती से हटा दी गई है, तो आप support@CircuitVerse.org पर एक सूचना भेज सकते हैं। कृपया शामिल करें:

# tos_section6_item1
source: • Your CircuitVerse username and email address;
hi: • आपका सर्किटवर्स यूजरनेम और ईमेल;

# tos_section6_item2
source: • The specific content you believe was taken down in error; and
hi: • आपके अनुसार विशिष्ट सामग्री को गलती से हटा दिया गया था; तथा
