Repository: CircuitVerse/mobile-app
Catalog: lib/l10n/app_*.arb
Languages: hi

# tos_section6_item3
source: • A brief statement of why you believe there was no copyright violation (e.g., the content was not copyrighted, you had permission to use the content, or your use of the content was a "fair use").
hi: • एक संक्षिप्त विवरण कि आप क्यों मानते हैं कि कोई कॉपीराइट उल्लंघन नहीं था (उदाहरण के लिए, सामग्री कॉपीराइट नहीं थी, आपको सामग्री का उपयोग करने की अनुमति थी, या सामग्री का आपका उपयोग "उचित उपयोग" था)।

# tos_section7_title
source: 7. Suspension and Termination of Accounts
hi: 7. खातों का निलंबन और समाप्ति

# tos_section7_text1
source: 7.1 CircuitVerse has the right to suspend your account for violations of the Terms of Use or Community Guidelines. Repeat violators may have their account deleted. The CircuitVerse Team reserves the sole right to determine what constitutes a violation of the Terms of Use or Community Guidelines. The CircuitVerse Team also reserves the right to terminate any account used to circumvent prior enforcement of the Terms of Use.
hi: 7.1 सर्किटवर्स को उपयोग की शर्तों या सामुदायिक दिशानिर्देशों के उल्लंघन के लिए आपके खाते को निलंबित करने का अधिकार है। बार-बार उल्लंघन करने वालों के खाते हटा दिए जा सकते हैं। सर्किटवर्स टीम यह निर्धारित करने का एकमात्र अधिकार सुरक्षित रखती है कि उपयोग की शर्तों या सामुदायिक दिशानिर्देशों का उल्लंघन क्या है। सर्किटवर्स टीम उपयोग की शर्तों के पूर्व प्रवर्तन को रोकने के लिए उपयोग किए गए किसी भी खाते को समाप्त करने का अधिकार भी सुरक्षित रखती है।

# tos_section7_text2
source: 7.2 If you want to delete or temporarily disable your account, please email
hi: 7.2 यदि आप अपना खाता हटाना या अस्थायी रूप से अक्षम करना चाहते हैं, तो कृपया ईमेल करें

# tos_section8_title
source: 8. Third Party Websites
hi: 8. तृतीय-पक्ष वेबसाइटें

# tos_section8_text1
source: 8.1 Content on CircuitVerse, including user-generated content, may include links to third-party websites. The CircuitVerse Team is not capable of reviewing or managing third-party websites, and assumes no responsibility for the privacy practices, content, or functionality of third party websites. You agree to relieve the CircuitVerse Team of any and all liability arising from third party websites.
hi: 8.1 सर्किटवर्स की सामग्री, जिसमें उपयोगकर्ता-जनित सामग्री शामिल है, में तृतीय-पक्ष वेबसाइटों के लिंक शामिल हो सकते हैं। सर्किटवर्स टीम तीसरे पक्ष की वेबसाइटों की समीक्षा या प्रबंधन करने में सक्षम नहीं है और तीसरे पक्ष की वेबसाइटों की गोपनीयता प्रथाओं, सामग्री या कार्यक्षमता के लिए कोई जिम्मेदारी नहीं लेती है। आप तृतीय-पक्ष वेबसाइटों से उत्पन्न होने वाली किसी भी और सभी देयताओं के सर्किटवर्स टीम को राहत देने के लिए सहमत हैं।

# tos_section9_title
source: 9. Indemnification
hi: 9. प्रीमियम

# tos_section9_text1
source: You agree to indemnify IIIT-Bangalore, the CircuitVerse Team, the CircuitVerse Foundation, and all their affiliates, employees, faculty members, fellows, students, agents, representatives, third party service providers, and members of their governing boards (all of which are "CircuitVerse Entities"), and to defend and hold each of them harmless, from any and all claims and liabilities (including attorneys' fees) arising out of or related to your breach of the Terms of Service or your use of CircuitVerse.
hi: आप IIIT-बैंगलोर, सर्किटवर्स टीम, सर्किटवर्स फाउंडेशन, और उनके सभी सहयोगियों, कर्मचारियों, संकाय सदस्यों, साथियों, छात्रों, एजेंटों, प्रतिनिधियों, तीसरे पक्ष के सेवा प्रदाताओं, और उनके शासी बोर्ड के सदस्यों (जिनमें से सभी) की क्षतिपूर्ति करने के लिए सहमत हैं। "सर्किटवर्स इकाइयां") हैं, और उनमें से प्रत्येक को किसी भी और सभी दावों और देनदारियों (वकीलों की फीस सहित) से या आपकी सेवा की शर्तों या सर्किटवर्स का उपयोग।

# tos_section9_text2
source: For federal government agencies, provisions in the Terms of Use relating to Indemnification shall not apply to your Official Use, except to the extent expressly authorized by federal law. For state and local government agencies in the United States, Terms of Use relating to Indemnification shall apply to your Official Use only to the extent authorized by the laws of your jurisdiction.
hi: संघीय सरकारी एजेंसियों के लिए, क्षतिपूर्ति से संबंधित उपयोग की शर्तों के प्रावधान संघीय कानून द्वारा स्पष्ट रूप से अधिकृत सीमा को छोड़कर, आपके आधिकारिक उपयोग पर लागू नहीं होंगे। संयुक्त राज्य में राज्य और स्थानीय सरकारी एजेंसियों के लिए, क्षतिपूर्ति से संबंधित उपयोग की शर्तें केवल आपके अधिकार क्षेत्र के कानूनों द्वारा अधिकृत सीमा तक ही आपके आधिकारिक उपयोग पर लागू होंगी।

# tos_section10_title
source: 10. Disclaimer of Warranty
hi: 10. वारंटी का अस्वीकरण

# tos_section10_text1
source: You acknowledge that you are using CircuitVerse at your own risk. CircuitVerse is provided "as is," and the CircuitVerse Entities hereby expressly disclaim any and all warranties, express and implied, including but not limited to any warranties of accuracy, reliability, title, merchantability, non-infringement, fitness for a particular purpose or any other warranty, condition, guarantee or representation, whether oral, in writing or in electronic form, including but not limited to the accuracy or completeness of any information contained therein or provided by CircuitVerse. Without limiting the foregoing, the CircuitVerse Entities disclaim any and all warranties, express and implied, regarding user-generated content and CircuitVerse Day events. The CircuitVerse Entities and their third party service providers do not represent or warrant that access to CircuitVerse will be uninterrupted or that there will be no failures, errors or omissions or loss of transmitted information, or that no viruses will be transmitted through CircuitVerse services.
hi: आप स्वीकार करते हैं कि आप अपने जोखिम पर सर्किटवर्स का उपयोग कर रहे हैं। सर्किटवर्स "जैसा है," और सर्किटवर्स एंटिटीज एतद्द्वारा किसी भी और सभी वारंटी, व्यक्त और निहित, को स्पष्ट रूप से अस्वीकार करते हैं, जिसमें सटीकता, विश्वसनीयता, शीर्षक, व्यापारिकता, गैर-उल्लंघन, किसी विशेष उद्देश्य के लिए फिटनेस या किसी अन्य वारंटी, शर्त, गारंटी या किसी भी वारंटी तक सीमित नहीं है। प्रतिनिधित्व, चाहे मौखिक, लिखित रूप में या इलेक्ट्रॉनिक रूप में, उसमें निहित या सर्किटवर्स द्वारा प्रदान की गई किसी भी जानकारी की सटीकता या पूर्णता तक सीमित नहीं है। पूर्वगामी को सीमित किए बिना, सर्किटवर्स एंटिटीज उपयोगकर्ता-जनित सामग्री और सर्किटवर्स डे इवेंट्स के संबंध में किसी भी और सभी वारंटी, व्यक्त और निहित, को अस्वीकार करते हैं। सर्किटवर्स एंटिटीज और उनके तीसरे पक्ष के सेवा प्रदाता प्रतिनिधित्व नहीं करते हैं या वारंट नहीं करते हैं कि सर्किटवर्स तक पहुंच निर्बाध होगी या प्रेषित जानकारी की कोई विफलता, त्रुटियां या चूक या हानि नहीं होगी, या सर्किटवर्स सेवाओं के माध्यम से कोई वायरस प्रसारित नहीं किया जाएगा।

# tos_section11_title
source: 11. Limitation of Liability
hi: 11. दायित्व की सीमा

# tos_section11_text1
source: The CircuitVerse Entities shall not be liable to you or any third parties for any direct, indirect, special, consequential or punitive damages of any kind, regardless of the type of claim or the nature of the cause of action, even if the CircuitVerse Team has been advised of the possibility of such damages. Without limiting the foregoing, the CircuitVerse Entities shall have no liability to you or any third parties for damages or harms arising out of user-generated content or CircuitVerse Day events.
hi: किसी भी प्रकार के प्रत्यक्ष, अप्रत्यक्ष, विशेष, परिणामी, या दंडात्मक नुकसान के लिए, सर्किटवर्स एंटिटीज आपके या किसी तीसरे पक्ष के लिए उत्तरदायी नहीं होंगे, भले ही किसी भी प्रकार के दावे या कार्रवाई के कारण की प्रकृति, भले ही सर्किटवर्स टीम इस तरह के नुकसान की संभावना की सलाह दी गई है। पूर्वगामी को सीमित किए बिना, सर्किटवर्स एंटिटीज का आपके या किसी तीसरे पक्ष के लिए उपयोगकर्ता-जनित सामग्री या सर्किटवर्स डे इवेंट्स से होने वाले नुकसान या नुकसान के लिए कोई दायित्व नहीं होगा।

# tos_section12_title
source: 12. Choice of Language
hi: 12. भाषा का चुनाव

# tos_section12_text1
source: If the CircuitVerse Team provides you with a translation of the English language version of these Terms of Use, the Privacy Policy, or any other policy, then you agree that the translation is provided for informational purposes only and does not modify the English language version. In the event of a conflict between a translation and the English version, the English version will govern.
hi: यदि सर्किटवर्स टीम आपको इन उपयोग की शर्तों, गोपनीयता नीति, या किसी अन्य नीति के अंग्रेजी भाषा संस्करण का अनुवाद प्रदान करती है, तो आप सहमत हैं कि अनुवाद केवल सूचनात्मक उद्देश्यों के लिए प्रदान किया गया है और अंग्रेजी भाषा संस्करण को संशोधित नहीं करता है। अनुवाद और अंग्रेजी संस्करण के बीच विरोध की स्थिति में, अंग्रेजी संस्करण नियंत्रित होगा।

# tos_section13_title
source: 13. No Waiver
hi: 13. कोई त्याग नहीं

# tos_section13_text1
source: No waiver of any term of these Terms of Use shall be deemed a further or continuing waiver of such term or any other term, and the CircuitVerse Team's failure to assert any right or provision under these Terms of Use shall not constitute a waiver of such right or provision.
hi: उपयोग की इन शर्तों की किसी भी शर्त के किसी भी छूट को इस तरह की अवधि या किसी अन्य अवधि के आगे या निरंतर छूट नहीं माना जाएगा, और इन उपयोग की शर्तों के तहत किसी भी अधिकार या प्रावधान का दावा करने में सर्किटवर्स टीम की विफलता ऐसे अधिकार की छूट का गठन नहीं करेगी। या प्रावधान।

# privacy_section1_text
source: We recognize that your privacy is very important and take it seriously. Our CircuitVerse Privacy Policy (“Privacy Policy”) describes our policies and procedures on the collection, use, disclosure, and sharing of your information when you use our Platform. We will not use or share your information with anyone except as described in this Privacy Policy. Capitalized terms that are not defined in this Privacy Policy have the meaning given them in our
hi: हम मानते हैं कि आपकी गोपनीयता बहुत महत्वपूर्ण है और इसे हम गंभीरता से लेते हैं। जब आप हमारे प्लेटफॉर्म का उपयोग करते हैं तो हमारी सर्किटवर्स गोपनीयता नीति (“गोपनीयता नीति“) आपकी जानकारी के संग्रह, उपयोग, प्रकटीकरण और साझा करने पर हमारी नीतियों और प्रक्रियाओं का वर्णन करती है। हम इस गोपनीयता नीति में वर्णित के अलावा आपकी जानकारी का उपयोग नहीं करेंगे और किसी के साथ साझा नहीं करेंगे। इस गोपनीयता नीति में परिभाषित नहीं किए गए बड़े अक्षरों का अर्थ यहाँ दिया गया है -

# privacy_section_2_title
source: The Information We Collect
hi: हमारे द्वारा एकत्रित की जाने वाली जानकारी

# privacy_section2_text
source: We collect information directly from individuals automatically through the CircuitVerse Platform.
hi: हम सर्किटवर्स प्लेटफॉर्म के माध्यम से स्वचालित रूप से व्यक्तियों से सीधे जानकारी जमा करते हैं।

# privacy_section2_item1
source: Account and Profile Information:
hi: खाता और प्रोफ़ाइल की जानकारी:

# privacy_section2_item1_text
source: When you create an account and profile on the CircuitVerse Platform, we collect your email-id. Your name, photo, and any other information that you choose to add to your public-facing profile will be available for viewing to users of our Platform. Once you activate a profile, other users will be able to see in your profile certain information about your activity.
hi: जब आप सर्किटवर्स प्लेटफॉर्म पर एक खाता और प्रोफ़ाइल बनाते हैं, तो हम आपकी ईमेल-आईडी एकत्र करते हैं। आपका नाम, फोटो, और कोई भी अन्य जानकारी जिसे आप अपनी सार्वजनिक-सामना करने वाली प्रोफ़ाइल में जोड़ने के लिए चुनते हैं, हमारे प्लेटफ़ॉर्म के उपयोगकर्ताओं को देखने के लिए उपलब्ध होगी। एक बार जब आप किसी प्रोफ़ाइल को सक्रिय कर देते हैं, तो अन्य उपयोगकर्ता आपकी प्रोफ़ाइल में आपकी गतिविधि के बारे में कुछ जानकारी देख सकेंगे।

# privacy_section2_item2
source: Integrated Service Provider and Linked Networks.
hi: इंटीग्रेटेड सर्विस प्रोवाइडर और लिंक्ड नेटवर्क।

# privacy_section2_item2_text
source: If you elect to connect your CircuitVerse account to another online service provider, such as a social networking service (“Integrated Service Provider”), you will be allowing us to pass to and receive from the Integrated Service Provider your log-in information and other user data. You may elect to sign in or sign up to the CircuitVerse Platform through a linked network like Facebook or Google (each a “Linked Network”).The specific information we may collect varies by Integrated Service Provider, but the permissions page for each will describe the relevant information. Integrated Service Providers control how they use and share your information; you should consult their respective privacy policies for information about their practices.
hi: यदि आप अपने सर्किटवर्स खाते को किसी अन्य ऑनलाइन सर्विस प्रोवाइडर, जैसे कि सोशल नेटवर्किंग सेवा (“इंटीग्रेटेड सर्विस प्रोवाइडर“) से जोड़ने का चुनाव करते हैं, तो आप हमें इंटीग्रेटेड सर्विस को पास करने और प्राप्त करने की अनुमति देंगे। अपनी लॉग-इन जानकारी और अन्य उपयोगकर्ता डेटा प्रदान करें। आप फेसबुक या गूगल (प्रत्येक एक “लिंक्ड नेटवर्क“) जैसे लिंक किए गए नेटवर्क के माध्यम से सर्किटवर्स प्लेटफॉर्म पर साइन इन या साइन अप करने का चुनाव कर सकते हैं। हमारे द्वारा एकत्र की जाने वाली विशिष्ट जानकारी इंटीग्रेटेड सर्विस प्रोवाइडर द्वारा भिन्न होती है, लेकिन प्रत्येक के लिए अनुमति पृष्ठ प्रासंगिक जानकारी का वर्णन करेगा। इंटीग्रेटेड सर्विस प्रोवाइडर नियंत्रित करते हैं कि वे आपकी जानकारी का उपयोग और साझा कैसे करते हैं; आपको उनकी प्रथाओं के बारे में जानकारी के लिए उनकी संबंधित गोपनीयता नीतियों से परामर्श लेना चाहिए।

# privacy_section2_item3
source: Automatically Collected Information About Your Activity.
hi: आपकी गतिविधि के बारे में स्वचालित रूप से एकत्रित जानकारी।

# privacy_section2_item3_text
source: We use cookies, log files, pixel tags, local storage objects, and other tracking technologies to automatically collect information about your activities, such as your searches, page views, date and time of your visit, and other information about your use of the CircuitVerse Platform.
hi: हम आपकी गतिविधियों के बारे में स्वचालित रूप से जानकारी एकत्र करने के लिए कुकीज़, लॉग फाइल, पिक्सेल टैग, लोकल स्टोरेज ऑब्जेक्ट और अन्य ट्रैकिंग तकनीकों का उपयोग करते हैं, जैसे कि आपकी खोज, पृष्ठ दृश्य, आपकी यात्रा की तिथि और समय, और सर्किटवर्स मंच के आपके उपयोग के बारे में अन्य जानकारी जमा की जाती है।

# privacy_section3_title
source: How We Use Your Information
hi: हम आपकी सूचना का किस प्रकार प्रयोग करते हैं

# privacy_section3_text
source: We do not sell your personally identifying information – such as your name and contact information – to third parties to use for their own marketing purposes.
hi: हम आपकी व्यक्तिगत रूप से पहचान करने वाली जानकारी - जैसे आपका नाम और संपर्क जानकारी - थर्ड पार्टीज को अपने स्वयं के रिसर्च उद्देश्यों के लिए उपयोग करने के लिए नहीं बेचते हैं।

# privacy_section3_list_header
source: CircuitVerse uses the information we collect:
hi: सर्किटवर्स हमारे द्वारा निचे दी गयी एकत्रित जानकारी का उपयोग करता है:

# privacy_section3_item1
source: • To provide you the services we offer on the CircuitVerse Platform, communicate with you about your use of the CircuitVerse Platform, respond to your inquiries, provide troubleshooting, and for other customer service purposes.
hi: • आपको सेवाएं प्रदान करने के लिए जो हम सर्किटवर्स प्लेटफॉर्म पर प्रदान करते हैं, सर्किटवर्स प्लेटफॉर्म के आपके उपयोग के बारे में आपसे संवाद करते हैं, आपकी पूछताछ का जवाब देते हैं, समस्या निवारण प्रदान करते हैं, और अन्य ग्राहक सेवा उद्देश्यों के लिए।

# privacy_section3_item2
source: • To tailor the content and information that we may send or display to you in the CircuitVerse Platform.
hi: • उस कंटेंट और जानकारी को तैयार करने के लिए जिसे हम आपको सर्किटवर्स प्लेटफॉर्म में भेज या प्रदर्शित कर सकते हैं।

# privacy_section3_item3
source: • To better understand how users access and use the CircuitVerse Platform both on an aggregated and individualized basis, and for other research and analytical purposes.
hi: • यह बेहतर ढंग से समझने के लिए कि उपयोगकर्ता कैसे सर्किटवर्स प्लेटफॉर्म का उपयोग एक समग्र और व्यक्तिगत आधार पर और अन्य शोध और विश्लेषणात्मक उद्देश्यों के लिए करते हैं।

# privacy_section3_item4
source: • To evaluate and improve the CircuitVerse Platform and to develop new products and services.
hi: • सर्किटवर्स प्लेटफॉर्म का मूल्यांकन और सुधार करने और नए प्रोडक्ट्स और सेवाओं को विकसित करने के लिए।

# privacy_section3_item5
source: • To comply with legal obligations, as part of our general business operations, and for other business administration purposes.
hi: • कानूनी दायित्वों का पालन करने के लिए, हमारे सामान्य व्यवसाय संचालन के हिस्से के रूप में, और अन्य व्यवसाय प्रशासन उद्देश्यों के लिए।

# privacy_section3_item6
source: • Where we believe necessary to investigate, prevent or take action regarding illegal activities, suspected fraud, situations involving potential threats to the safety of any person or violations of our Terms of Use or this Privacy Policy.
hi: • जहां हम अवैध गतिविधियों, संदिग्ध धोखाधड़ी, किसी भी व्यक्ति की सुरक्षा के लिए संभावित खतरों या हमारी उपयोग की शर्तों या इस गोपनीयता नीति के उल्लंघन से संबंधित स्थितियों की जांच, रोकथाम या कार्रवाई करना आवश्यक समझते हैं।

# privacy_section3_text2_title
source: Your Content and Activity.
hi: आपका कंटेंट और गतिविधि।

# privacy_section3_text2
source: Your Content, including your name, profile picture, profile information, and certain associated activity information is available to other users of the CircuitVerse Platform and may be viewed publicly. Public viewing includes availability to non-registered visitors and can occur when users share Your Content across other sites or services. In addition, Your Content may be indexed by search engines.
hi: आपका नाम, प्रोफ़ाइल पर चित्र, प्रोफ़ाइल की जानकारी, और कुछ सम्भंदित गतिविधि जानकारी सहित आपका कंटेंट, सर्किटवर्स प्लेटफ़ॉर्म के अन्य उपयोगकर्ताओं के लिए उपलब्ध है और इसे सार्वजनिक रूप से देखा जा सकता है। सार्वजनिक देखने में गैर-पंजीकृत आगंतुकों के लिए उपलब्धता शामिल है और यह तब हो सकता है जब उपयोगकर्ता आपके कंटेंट को अन्य साइटों या सेवाओं पर साझा करते हैं। इसके अलावा, आपके कंटेंट को सर्च इंजन द्वारा अनुक्रमित किया जा सकता है।

# privacy_section3_text3_title
source: Anonymized and Aggregated Data.
hi: अज्ञात और समेकित डेटा।

# privacy_section3_text3
source: We may share aggregate or de-identified information with third parties for research, marketing, analytics and other purposes, provided such information does not identify a particular individual.
hi: हम रिसर्च, मार्केटिंग , एनालिटिक्स और अन्य उद्देश्यों के लिए थर्ड पार्टीज के साथ समग्र या गैर-पहचान की गई जानकारी साझा कर सकते हैं, बशर्ते ऐसी जानकारी किसी विशेष व्यक्ति की पहचान न करे।

# privacy_section3_text4_title
source: Tracking.
hi: ट्रैकिंग

# privacy_section3_text4_string1
source: Analytics Tools -We may use internal and third party analytics tools, including
hi: एनालिटिक्स टूल हम

source: Google Analytics
hi: गूगल एनालिटिक्स

# privacy_section3_text4_string2
source: . The third party analytics companies we work with may combine the information collected with other information they have independently collected from other websites and/or other online products and services. Their collection and use of information is subject to their own privacy policies.
hi: सहित आंतरिक और थर्ड पार्टी एनालिटिक्स टूल का उपयोग कर सकते हैं. हम जिस थर्ड पार्टी एनालिटिक्स कंपनियों के साथ काम करते हैं, वे अन्य वेबसाइटों और/या अन्य ऑनलाइन प्रोडक्ट्स और सेवाओं से स्वतंत्र रूप से एकत्र की गई अन्य जानकारी के साथ एकत्रित जानकारी को जोड़ सकते हैं। उनका संग्रह और जानकारी का उपयोग उनकी अपनी गोपनीयता नीतियों के अधीन है।

source: Contact Us
hi: हमे संपर्क करें

# contact_us_text
source: If you have any questions about our practices or this Privacy Policy, please contact us at
hi: यदि हमारे व्यवहार या इस गोपनीयता नीति के बारे में आपके कोई प्रश्न हैं, तो कृपया हमसे संपर्क करें -
