Repository: CircuitVerse/mobile-app
Catalog: lib/l10n/app_*.arb
Languages: hi

# home_header_title
source: Dive into the world of Logic Circuits for free!
hi: तर्क सर्किट की दुनिया में मुफ्त में डुबकी लगाएं!

# home_header_subtitle
source: From Simple gates to complex sequential circuits, plot timing diagrams, automatic circuit generation, explore standard ICs, and much more
hi: सरल गेट्स से लेकर जटिल अनुक्रमिक सर्किट्स तक, टाइमिंग डायग्राम प्लॉट करें, स्वचालित सर्किट जनरेशन, मानक आईसी एक्सप्लोर करें और बहुत कुछ

# teachers_button
source: For Teachers
hi: शिक्षकों के लिए

# contributors_button
source: For Contributors
hi: योगदानकर्ताओं के लिए

# features_title
source: Features
hi: विशेषताएं

# features_subtitle
source: Design circuits quickly and easily with a modern and intuitive user interface with drag-and-drop, copy/paste, zoom and more.
hi: ड्रैग-एंड-ड्रॉप, कॉपी/पेस्ट, ज़ूम और अन्य आधुनिक व सहज यूजर इंटरफेस के साथ सर्किट्स को जल्दी और आसानी से डिज़ाइन करें।

# feature1_title
source: Explore High Resolution Images
hi: हाई रेजोल्यूशन इमेजेज एक्सप्लोर करें

# feature1_description
source: CircuitVerse can export high resolution images in multiple formats including SVG.
hi: सर्किटवर्स एसवीजी सहित कई फॉर्मेट में हाई रेजोल्यूशन इमेजेज एक्सपोर्ट कर सकता है।

# feature2_title
source: Combinational Analysis
hi: कॉम्बिनेशनल एनालिसिस

# feature2_description
source: Automatically generate circuit based on truth table data. This is great to create complex logic circuits and can be easily be made into a subcircuit.
hi: ट्रुथ टेबल डेटा के आधार पर स्वचालित रूप से सर्किट जनरेट करें। यह जटिल लॉजिक सर्किट बनाने के लिए बेहतरीन है और आसानी से सबसर्किट में बदला जा सकता है।

# feature3_title
source: Embed in Blogs
hi: ब्लॉग्स में एम्बेड करें

# feature3_description
source: Since CircuitVerse is built in HTML5, an iFrame can be generated for each project allowing the user to embed it almost anywhere.
hi: चूंकि सर्किटवर्स HTML5 में बना है, प्रत्येक प्रोजेक्ट के लिए एक आईफ्रेम जनरेट किया जा सकता है जिसे लगभग कहीं भी एम्बेड किया जा सकता है।

# feature4_title
source: Use Sub circuits
hi: सब सर्किट्स का उपयोग करें

# feature4_description
source: Create subcircuits once and use them repeatedly. This allows easier and more structured design.
hi: सबसर्किट्स एक बार बनाएं और बार-बार उनका उपयोग करें। इससे डिज़ाइन आसान और अधिक संरचित होता है।

# feature5_title
source: Multi Bit Buses and components
hi: मल्टी बिट बसें और कंपोनेंट्स

# feature5_description
source: CircuitVerse supports multi bit wires, this means circuit design is easier, faster and uncluttered.
hi: सर्किटवर्स मल्टी बिट वायर्स को सपोर्ट करता है, इसका मतलब है कि सर्किट डिज़ाइन आसान, तेज़ और अव्यवस्था रहित है।

# editor_picks_title
source: Editor Picks
hi: एडिटर की पसंद

# editor_picks_subtitle
source: These circuits have been hand-picked by our authors for their awesomeness
hi: ये सर्किट्स हमारे लेखकों द्वारा उनकी शानदारता के लिए चुने गए हैं

# explore_more_button
source: Explore More
hi: और एक्सप्लोर करें

# teachers_title
source: TEACHERS
hi: शिक्षक

# teachers_description
source: CircuitVerse has been designed to be very easy to use in class. The platform has features to assist teachers in class and assignments.
hi: CircuitVerse को कक्षा में उपयोग करने में बहुत आसान बनाया गया है। प्लेटफॉर्म में शिक्षकों की सहायता के लिए विशेषताएं हैं।

# benefits_title
source: Benefits
hi: लाभ

# teachers_feature1_title
source: Create Groups and add your students
hi: समूह बनाएं और अपने छात्रों को जोड़ें

# teachers_feature1_description
source: You can create groups and add your students to them! If students are already registered with CircuitVerse they will be added automatically. If they are not registered with CircuitVerse yet, an invitation will be sent to register. Once they register, they will be added automatically.
hi: आप समूह बना सकते हैं और उनमें अपने छात्रों को जोड़ सकते हैं! यदि छात्र पहले से ही CircuitVerse के साथ पंजीकृत हैं तो वे स्वचालित रूप से जोड़ दिए जाएंगे। यदि वे अभी तक CircuitVerse के साथ पंजीकृत नहीं हैं, तो पंजीकरण के लिए एक निमंत्रण भेजा जाएगा। एक बार पंजीकृत होने के बाद, वे स्वचालित रूप से जोड़ दिए जाएंगे।

# teachers_feature2_title
source: Post Assignments
hi: असाइनमेंट पोस्ट करें

# teachers_feature2_description
source: To create an assignment, simply click an add new assignment button. Give the details of the assignment and the deadline. The assignment will automatically close at deadline. Students cannot continue their assignment unless the teacher reopens the assignment again.
hi: असाइनमेंट बनाने के लिए, बस एक नया असाइनमेंट बटन पर क्लिक करें। असाइनमेंट का विवरण और समय सीमा दें। असाइनमेंट स्वचालित रूप से समय सीमा पर बंद हो जाएगा। छात्र अपना असाइनमेंट तब तक जारी नहीं रख सकते जब तक कि शिक्षक असाइनमेंट को फिर से न खोल दे।

# teachers_feature3_title
source: Grading assignments
hi: असाइनमेंट ग्रेडिंग

# teachers_feature3_description
source: Grade assignments very easily with the in build preview. Simply select the student, to his/her assignment work.
hi: इन-बिल्ड पूर्वावलोकन के साथ असाइनमेंट को बहुत आसानी से ग्रेड करें। बस छात्र का चयन करें, उसके असाइनमेंट कार्य पर।

# teachers_feature4_title
source: Use Interactive Circuits in your Blogs, Study Materials or PowerPoint presentations
hi: अपने ब्लॉग्स, अध्ययन सामग्री या PowerPoint प्रस्तुतियों में इंटरैक्टिव सर्किट का उपयोग करें

# teachers_feature4_description
source: Make sure the project is public. Click on embed, to get the embed HTML5 code, then simply embed the circuit. You may need to use a PowerPoint plugin like Live Slides to embed the live Circuit.
hi: सुनिश्चित करें कि प्रोजेक्ट सार्वजनिक है। एम्बेड HTML5 कोड प्राप्त करने के लिए एम्बेड पर क्लिक करें, फिर बस सर्किट को एम्बेड करें। लाइव सर्किट को एम्बेड करने के लिए आपको PowerPoint प्लगइन जैसे लाइव स्लाइड्स का उपयोग करने की आवश्यकता हो सकती है।

# contribute_title
source: CONTRIBUTE
hi: योगदान दें

# contribute_description
source: CircuitVerse aims to be free forever and we promise that we won't run any ads! The project is open source and to ensure its continued development and maintenance we need your support.
hi: CircuitVerse का लक्ष्य हमेशा मुफ्त रहना है और हम वादा करते हैं कि हम कोई विज्ञापन नहीं चलाएंगे! यह परियोजना ओपन सोर्स है और इसके निरंतर विकास और रखरखाव के लिए हमें आपके समर्थन की आवश्यकता है।

# email_us_title
source: Email us at
hi: हमें ईमेल करें

# join_chat_title
source: Join and chat with us at
hi: हमसे जुड़ें और चैट करें

source: Slack channel
hi: स्लैक चैनल

# open_source_title
source: Contribute to open source
hi: ओपन सोर्स में योगदान दें

source: How to Support?
hi: कैसे समर्थन करें?

# student_role
source: I am a Student
hi: मैं एक छात्र हूँ

# student_support1
source: Create amazing circuits and share on the platform
hi: अद्भुत सर्किट बनाएं और प्लेटफॉर्म पर साझा करें

# student_support2
source: Find and report bugs. Become a bug hunter
hi: बग ढूंढें और रिपोर्ट करें। एक बग हंटर बनें

# student_support3
source: Introduce the platform to your buddies
hi: प्लेटफॉर्म को अपने दोस्तों से परिचित कराएं

# teacher_role
source: I am a Teacher
hi: मैं एक शिक्षक हूँ

# teacher_support1
source: Introduce the platform to your students
hi: प्लेटफॉर्म को अपने छात्रों से परिचित कराएं

# teacher_support2
source: Promote the platform within your circles
hi: अपने मंडली में प्लेटफॉर्म को प्रचारित करें

# teacher_support3
source: Create exciting educational content using CircuitVerse
hi: CircuitVerse का उपयोग करके रोमांचक शैक्षिक सामग्री बनाएं

# developer_role
source: I am a Developer
hi: मैं एक डेवलपर हूँ

# developer_support1
source: Contribute to the OpenSource projects
hi: ओपन सोर्स परियोजनाओं में योगदान दें

# developer_support2
source: Add and propose new features to the projects
hi: परियोजनाओं में नई सुविधाएँ जोड़ें और प्रस्तावित करें

# developer_support3
source: Find and fix bugs in the CircuitVerse projects
hi: CircuitVerse परियोजनाओं में बग ढूंढें और ठीक करें

# become_patreon
source: Become a Patreon
hi: Patreon बनें

# donate_paypal
source: Donate through PayPal
hi: PayPal के माध्यम से दान करें

# profile_update_title
source: Update Profile
hi: प्रोफ़ाइल अपडेट करें

source: Profile Picture
hi: प्रोफ़ाइल चित्र

# profile_name
source: Name
hi: नाम

# profile_name_empty_error
source: Name can't be empty
hi: नाम खाली नहीं हो सकता

# profile_country
source: Country
hi: देश

# profile_educational_institute
source: Educational Institute
hi: शैक्षणिक संस्थान

# profile_subscribe_mails
source: Subscribe to mails?
hi: मेल की सदस्यता लें?

# profile_save_details
source: Save Details
hi: विवरण सहेजें

# profile_updating
source: Updating...
hi: अपडेट हो रहा है...

source: Profile Updated
hi: प्रोफ़ाइल अपडेट हो गई

# profile_update_success
source: Your profile was successfully updated.
hi: आपकी प्रोफ़ाइल सफलतापूर्वक अपडेट हो गई।

# profile_update_error
source: An error occurred while updating your profile.
hi: आपकी प्रोफ़ाइल अपडेट करते समय एक त्रुटि हुई।

# no_favorites_title
source: No favorites yet!
hi: अभी तक कोई पसंदीदा नहीं!

# no_favorites_subtitle
source: Explore projects and add them to your favorites list
hi: प्रोजेक्ट्स एक्सप्लोर करें और उन्हें अपनी पसंदीदा सूची में जोड़ें

# no_projects_title
source: No Projects Yet!
hi: अभी तक कोई प्रोजेक्ट नहीं!

# no_projects_subtitle
source: Start fresh with a new design or fork existing templates
hi: नए डिज़ाइन से शुरुआत करें या मौजूदा टेम्प्लेट को फोर्क करें

# forgot_password_email
source: Email
hi: ईमेल

# forgot_password_email_validation_error
source: Please enter a valid email
hi: कृपया एक वैध ईमेल दर्ज करें

# forgot_password_send_instructions
source: Send Instructions
hi: निर्देश भेजें

# forgot_password_sending
source: Sending..
hi: भेजा जा रहा है..

# forgot_password_new_user
source: New User?
hi: नया उपयोगकर्ता?

# forgot_password_sign_up
source: Sign Up
hi: साइन अप करें

# forgot_password_sending_instructions
source: Sending Instructions
hi: निर्देश भेजे जा रहे हैं

# forgot_password_instructions_sent_title
source: Instructions Sent
hi: निर्देश भेजे गए

# forgot_password_instructions_sent_message
source: Password reset instructions have been sent to your email
hi: पासवर्ड रीसेट निर्देश आपके ईमेल पर भेज दिए गए हैं

# forgot_password_error
source: Error
hi: त्रुटि

# forgot_password_link
source: Forgot Password?
hi: पासवर्ड भूल गए?

# login_email
source: Email
hi: ईमेल

# login_email_validation_error
source: Please enter a valid email
hi: कृपया एक वैध ईमेल दर्ज करें

# login_password_validation_error
source: Password can't be empty
hi: पासवर्ड खाली नहीं हो सकता

# login_forgot_password
source: Forgot Password?
hi: पासवर्ड भूल गए?

# login_authenticating
source: Authenticating...
hi: प्रमाणीकरण हो रहा है...

# login_button
source: Login
hi: लॉग इन

# login_new_user
source: New User?
hi: नया उपयोगकर्ता?

# login_sign_up
source: Sign Up
hi: साइन अप करें

# login_success_title
source: Login Successful
hi: लॉगिन सफल

# login_success_message
source: Welcome back!
hi: वापसी का स्वागत है!

# login_error
source: Error
hi: त्रुटि

# signup_name
source: Name
hi: नाम

# signup_name_validation_error
source: Name can't be empty
hi: नाम खाली नहीं हो सकता

# signup_email
source: Email
hi: ईमेल

# signup_email_validation_error
source: Please enter a valid email
hi: कृपया एक वैध ईमेल दर्ज करें

# signup_password_validation_error
source: Password can't be empty
hi: पासवर्ड खाली नहीं हो सकता

# signup_password_length_error
source: Password length should be at least 6
hi: पासवर्ड की लंबाई कम से कम 6 होनी चाहिए

# signup_authenticating
source: Authenticating...
hi: प्रमाणीकरण हो रहा है...

# signup_register
source: Register
hi: रजिस्टर करें

# signup_already_registered
source: Already Registered?
hi: पहले से पंजीकृत?

# signup_login
source: Login
hi: लॉग इन

# signup_success_title
source: Signup Successful
hi: साइनअप सफल

# signup_success_message
source: Welcome to CircuitVerse!
hi: सर्किटवर्स में आपका स्वागत है!

# signup_error
source: Error
hi: त्रुटि

# assignment_letter_grade
source: Letter Grade
hi: लेटर ग्रेड

# assignment_percent
source: Percent
hi: प्रतिशत

# assignment_custom
source: Custom
hi: कस्टम

# assignment_name
source: Name
hi: नाम

# assignment_name_validation_error
source: Please enter a valid name
hi: कृपया एक वैध नाम दर्ज करें

# assignment_deadline
source: Deadline
hi: अंतिम तिथि

# assignment_grading_scale
source: Grading Scale
hi: ग्रेडिंग स्केल

# assignment_elements_restriction
source: Elements Restriction
hi: तत्व प्रतिबंध

# assignment_enable_elements_restriction
source: Enable elements restriction
hi: तत्व प्रतिबंध सक्षम करें

# assignment_create
source: Create Assignment
hi: असाइनमेंट बनाएं

# assignment_adding
source: Adding Assignment
hi: असाइनमेंट जोड़ा जा रहा है

source: Assignment Added
hi: असाइनमेंट जोड़ा गया

# assignment_add_success
source: New assignment was successfully added
hi: नया असाइनमेंट सफलतापूर्वक जोड़ा गया

# assignment_add_error
source: Error
hi: त्रुटि

# assignment_add_title
source: Add Assignment
hi: असाइनमेंट जोड़ें

# assignment_no_scale
source: No Scale
hi: कोई स्केल नहीं

# assignment_details_edit
source: Edit
hi: संपादित करें

# assignment_details_name
source: Name
hi: नाम

# assignment_details_not_applicable
source: N.A
hi: लागू नहीं

# assignment_details_description
source: Description
hi: विवरण

# assignment_details_submissions
source: Submissions
hi: प्रस्तुतियाँ

# assignment_details_no_submissions_yet
source: No Submissions yet!
hi: अभी तक कोई प्रस्तुति नहीं!

# assignment_details_adding_grades
source: Adding Grades...
hi: ग्रेड जोड़े जा रहे हैं...

# assignment_details_project_graded_successfully
source: Project Graded Successfully
hi: प्रोजेक्ट सफलतापूर्वक ग्रेड किया गया

# assignment_details_project_graded_message
source: You have graded the project
hi: आपने प्रोजेक्ट को ग्रेड कर दिया है

# assignment_details_error
source: Error
hi: त्रुटि

# assignment_details_updating_grade
source: Updating Grade...
hi: ग्रेड अपडेट किया जा रहा है...

# assignment_details_grade_updated_successfully
source: Grade updated Successfully
hi: ग्रेड सफलतापूर्वक अपडेट हो गया

# assignment_details_grade_updated_message
source: Grade has been updated successfully
hi: ग्रेड सफलतापूर्वक अपडेट हो गया है

# assignment_details_delete_grade
source: Delete Grade
hi: ग्रेड हटाएं

# assignment_details_delete_grade_confirmation
source: Are you sure you want to delete the grade?
hi: क्या आप वाकई ग्रेड हटाना चाहते हैं?

# assignment_details_delete
source: DELETE
hi: हटाएं

# assignment_details_deleting_grade
source: Deleting Grade...
hi: ग्रेड हटाया जा रहा है...

# assignment_details_grade_deleted
source: Grade Deleted
hi: ग्रेड हटा दिया गया

# assignment_details_grade_deleted_message
source: Grade has been removed successfully
hi: ग्रेड सफलतापूर्वक हटा दिया गया है

# assignment_details_grades_and_remarks
source: Grades & Remarks
hi: ग्रेड और टिप्पणियाँ

# assignment_details_grade
source: Grade
hi: ग्रेड

# assignment_details_grade_validation_error
source: Grade can't be empty
hi: ग्रेड खाली नहीं हो सकता

# assignment_details_remarks
source: Remarks
hi: टिप्पणियाँ

# assignment_details_update
source: Update
hi: अपडेट करें

# assignment_details_submit
source: Submit
hi: सबमिट करें

# assignment_details_title
source: Assignment Details
hi: असाइनमेंट विवरण

# assignment_details_deadline
source: Deadline
hi: अंतिम तिथि

# assignment_details_time_remaining
source: Time Remaining
hi: शेष समय

# assignment_details_days
source: days
hi: दिन

# assignment_details_hours
source: hours
hi: घंटे

# assignment_details_minutes
source: minutes
hi: मिनट

# assignment_details_restricted_elements
source: Restricted Elements
hi: प्रतिबंधित तत्व

# edit_group_updating
source: Updating...
hi: अपडेट हो रहा है...

# edit_group_updated
source: Group Updated
hi: समूह अपडेट हो गया

# edit_group_update_success
source: Group has been successfully updated
hi: समूह सफलतापूर्वक अपडेट हो गया है

# edit_group_error
source: Error
hi: त्रुटि

# edit_group_title
source: Edit Group
hi: समूह संपादित करें

# edit_group_description
source: You can update Group details here. Don't leave the Group Name blank.
hi: आप यहां समूह विवरण अपडेट कर सकते हैं। समूह का नाम खाली न छोड़ें।

# edit_group_name
source: Group Name
hi: समूह का नाम

# edit_group_name_validation_error
source: Please enter a Group Name
hi: कृपया एक समूह नाम दर्ज करें

# edit_group_save
source: Save
hi: सहेजें

# group_details_edit
source: Edit
hi: संपादित करें

# group_details_primary_mentor
source: Primary Mentor
hi: प्राथमिक सलाहकार

# group_details_adding
source: Adding...
hi: जोड़ा जा रहा है...

# group_details_members_added
source: Group Members Added
hi: समूह सदस्य जोड़े गए

# group_details_error
source: Error
hi: त्रुटि

# group_details_add_members
source: Add Group Members
hi: समूह सदस्य जोड़ें

# group_details_add_mentors
source: Add Mentors
hi: सलाहकार जोड़ें

# group_details_add_members_description
source: Enter Email IDs separated by commas. If users are not registered, an email ID will be sent requesting them to sign up.
hi: कॉमा से अलग किए गए ईमेल आईडी दर्ज करें। यदि उपयोगकर्ता पंजीकृत नहीं हैं, तो उन्हें साइन अप करने के लिए एक ईमेल आईडी भेजा जाएगा।

# group_details_email_validation_error
source: Enter emails in valid format
hi: मान्य प्रारूप में ईमेल दर्ज करें

# group_details_cancel
source: Cancel
hi: रद्द करें

# group_details_remove_member
source: Remove Group Member
hi: समूह सदस्य हटाएं

# group_details_remove_mentor
source: Remove Mentor
hi: सलाहकार हटाएं

# group_details_remove_member_confirmation
source: Are you sure you want to remove this group member?
hi: क्या आप वाकई इस समूह सदस्य को हटाना चाहते हैं?

# group_details_remove_mentor_confirmation
source: Are you sure you want to remove this mentor?
hi: क्या आप वाकई इस सलाहकार को हटाना चाहते हैं?

# group_details_remove
source: Remove
hi: हटाएं

# group_details_removing
source: Removing...
hi: हटाया जा रहा है...

# group_details_member_removed
source: Group Member Removed
hi: समूह सदस्य हटाया गया

# group_details_mentor_removed
source: Mentor Removed
hi: सलाहकार हटाया गया

# group_details_member_removed_success
source: Successfully removed
hi: सफलतापूर्वक हटाया गया

# group_details_mentors
source: Mentors
hi: सलाहकार

# group_details_members
source: Members
hi: सदस्य

# group_details_assignments
source: Assignments
hi: असाइनमेंट

# group_details_add
source: Add
hi: जोड़ें

# group_details_delete_assignment
source: Delete Assignment
hi: असाइनमेंट हटाएं

# group_details_delete_assignment_confirmation
source: Are you sure you want to delete this assignment?
hi: क्या आप वाकई इस असाइनमेंट को हटाना चाहते हैं?

# group_details_delete
source: Delete
hi: हटाएं

# group_details_deleting_assignment
source: Deleting Assignment...
hi: असाइनमेंट हटाया जा रहा है...

# group_details_assignment_deleted
source: Assignment Deleted
hi: असाइनमेंट हटाया गया

# group_details_assignment_deleted_success
source: The assignment was successfully deleted
hi: असाइनमेंट सफलतापूर्वक हटाया गया

# group_details_reopen_assignment
source: Reopen Assignment
hi: असाइनमेंट पुनः खोलें

# group_details_reopen_assignment_confirmation
source: Are you sure you want to reopen this assignment?
hi: क्या आप वाकई इस असाइनमेंट को पुनः खोलना चाहते हैं?

# group_details_reopen
source: Reopen
hi: पुनः खोलें

# group_details_reopening_assignment
source: Reopening Assignment...
hi: असाइनमेंट पुनः खोला जा रहा है...

# group_details_assignment_reopened
source: Assignment Reopened
hi: असाइनमेंट पुनः खोला गया

# group_details_assignment_reopened_success
source: The assignment is reopened now
hi: असाइनमेंट अब पुनः खुला है

# group_details_start_assignment
source: Start Assignment
hi: असाइनमेंट शुरू करें

# group_details_start_assignment_confirmation
source: Are you sure you want to start working on this assignment?
hi: क्या आप वाकई इस असाइनमेंट पर काम शुरू करना चाहते हैं?

# group_details_start
source: Start
hi: शुरू करें

# group_details_starting_assignment
source: Starting Assignment...
hi: असाइनमेंट शुरू किया जा रहा है...

# group_details_project_created
source: Project Created
hi: प्रोजेक्ट बनाया गया

# group_details_project_created_success
source: Project is successfully created
hi: प्रोजेक्ट सफलतापूर्वक बनाया गया

# group_details_member
source: member
hi: सदस्य

# group_details_mentor
source: mentor
hi: सलाहकार

# group_details_make
source: Make
hi: बनाएं

# group_details_are_you_sure_you_want_to
source: Are you sure you want to
hi: क्या आप वाकई चाहते हैं

# group_details_promote
source: promote
hi: पदोन्नत करें

# group_details_demote
source: demote
hi: पदावनत करें

# group_details_this_group
source: this group
hi: इस समूह के

# group_details_to_a
source: to a
hi: को एक

# group_details_yes
source: Yes
hi: हाँ

# group_details_promoting
source: Promoting...
hi: पदोन्नत किया जा रहा है...

# group_details_demoting
source: Demoting...
hi: पदावनत किया जा रहा है...

# group_details_promoted
source: Promoted
hi: पदोन्नत किया गया

# group_details_demoted
source: Demoted
hi: पदावनत किया गया

# group_details_member_updated_success
source: Group member was successfully updated
hi: समूह सदस्य सफलतापूर्वक अपडेट किया गया

# group_details_title
source: Group Details
hi: समूह विवरण

# my_groups_explore_message
source: Explore and join groups of your school and friends!
hi: अपने स्कूल और दोस्तों के समूहों को एक्सप्लोर करें और जॉइन करें!

# my_groups_delete_group
source: Delete Group
hi: समूह हटाएं

# my_groups_delete_group_confirmation
source: Are you sure you want to delete this group?
hi: क्या आप वाकई इस समूह को हटाना चाहते हैं?

# my_groups_delete
source: Delete
hi: हटाएं

# my_groups_deleting_group
source: Deleting Group...
hi: समूह हटाया जा रहा है...

# my_groups_group_deleted
source: Group Deleted
hi: समूह हटाया गया

# my_groups_group_deleted_success
source: Group was successfully deleted
hi: समूह सफलतापूर्वक हटाया गया

# my_groups_error
source: Error
hi: त्रुटि

# my_groups_owned
source: Owned
hi: स्वामित्व वाले

# my_groups_view
source: View
hi: देखें

# my_groups_joined
source: Joined
hi: शामिल हुए

# my_groups_edit
source: Edit
hi: संपादन करें

# new_group_creating
source: Creating...
hi: बनाया जा रहा है...

# new_group_created
source: Group Created
hi: समूह बनाया गया

# new_group_created_success
source: New group was created successfully
hi: नया समूह सफलतापूर्वक बनाया गया

# new_group_error
source: Error
hi: त्रुटि

# new_group_title
source: New Group
hi: नया समूह

# new_group_description
source: Groups can be used by mentors to set projects for and give grades to students
hi: समूहों का उपयोग सलाहकारों द्वारा छात्रों के लिए परियोजनाएँ निर्धारित करने और ग्रेड देने के लिए किया जा सकता है

# new_group_name
source: Group Name
hi: समूह का नाम

# new_group_name_validation_error
source: Please enter a Group Name
hi: कृपया एक समूह नाम दर्ज करें

# new_group_save
source: Save
hi: सहेजें

# update_assignment_name
source: Name
hi: नाम

# update_assignment_name_validation_error
source: Please enter a valid name
hi: कृपया एक वैध नाम दर्ज करें

# update_assignment_description_hint
source: Enter assignment description...
hi: असाइनमेंट विवरण दर्ज करें...

# update_assignment_deadline
source: Deadline
hi: अंतिम तिथि

# update_assignment_elements_restriction
source: Elements restriction
hi: तत्व प्रतिबंध

# update_assignment_enable_elements_restriction
source: Enable elements restriction
hi: तत्व प्रतिबंध सक्षम करें

# update_assignment_title
source: Update Assignment
hi: असाइनमेंट अपडेट करें

# update_assignment_updating
source: Updating...
hi: अपडेट हो रहा है...

# update_assignment_description
source: Description
hi: विवरण

# update_assignment_updated
source: Assignment Updated
hi: असाइनमेंट अपडेट हो गया

# update_assignment_update_success
source: Assignment was updated successfully
hi: असाइनमेंट सफलतापूर्वक अपडेट हो गया

# update_assignment_error
source: Error
hi: त्रुटि

# ib_search_circuitverse
source: Search CircuitVerse
hi: सर्किटवर्स खोजें

# ib_navigate_chapters
source: Navigate to different chapters
hi: विभिन्न अध्यायों पर नेविगेट करें

# ib_circuitverse
source: CircuitVerse
hi: सर्किटवर्स

# ib_interactive_book
source: Interactive Book
hi: इंटरएक्टिव बुक
